tangyangguang/Esp8266Base/src/Esp8266BaseWiFi.cpp
#include "Esp8266BaseWiFi.h"
#if ESP8266BASE_USE_WIFI_CONFIG
#include "Esp8266BaseConfig.h"
#endif
#if ESP8266BASE_USE_JOURNAL
#include "Esp8266BaseJournal.h"
#endif
#include "Esp8266BaseLog.h"
#include <ESP8266WiFi.h>

// ----------------------------------------------------------------------------
// 静态成员定义
// ----------------------------------------------------------------------------
Esp8266BaseWiFiState Esp8266BaseWiFi::_state         = Esp8266BaseWiFiState::IDLE;
uint32_t             Esp8266BaseWiFi::_connectStart   = 0;
uint32_t             Esp8266BaseWiFi::_retryAt        = 0;
uint8_t              Esp8266BaseWiFi::_retryCount     = 0;
bool                 Esp8266BaseWiFi::_stuckRestarted = false;
uint8_t              Esp8266BaseWiFi::_failuresSinceRadioReset = 0;
uint16_t             Esp8266BaseWiFi::_attemptCount   = 0;
uint8_t              Esp8266BaseWiFi::_radioResetCount = 0;
char                 Esp8266BaseWiFi::_apSSID[28]     = "";
char                 Esp8266BaseWiFi::_ip[16]         = "";
char                 Esp8266BaseWiFi::_staSSID[64]    = "";
char                 Esp8266BaseWiFi::_staPass[64]    = "";

static void _formatIP(const IPAddress& ip, char* out, size_t len) {
    if (!out || len == 0) return;
    snprintf(out, len, "%u.%u.%u.%u",
             (unsigned)ip[0], (unsigned)ip[1], (unsigned)ip[2], (unsigned)ip[3]);
}

// ----------------------------------------------------------------------------
// begin
// ----------------------------------------------------------------------------
bool Esp8266BaseWiFi::begin() {
    // 生成 AP SSID，用 ChipID 后 4 位确保唯一性
    uint16_t suffix = (uint16_t)(ESP.getChipId() & 0xFFFF);
    snprintf(_apSSID, sizeof(_apSSID), "ESP8266-Config-%04X", suffix);

    // 关闭自动连接 / 自动重连（由状态机全权管理）
    WiFi.persistent(false);
    WiFi.setAutoConnect(false);
    WiFi.setAutoReconnect(false);
#if ESP8266BASE_WIFI_NO_SLEEP
    // 显式关闭 modem sleep（电台常开）：零省电，用于弱信号排障或低延迟场景。
    WiFi.setSleepMode(WIFI_NONE_SLEEP);
    ESP8266BASE_LOG_I_P("WiFi", "sleep_policy=none reason=explicit_no_sleep");
#else
    // 显式 modem-sleep MIN 级（setSleepMode 第二参 0 => 最小睡眠级）：
    // 每个 DTIM 醒一次收 beacon，省电与稳定性平衡，不依赖 SDK 隐性默认；
    // 不启用 MAX 级（按 listen interval 长睡会放大弱信号丢 beacon/deauth 风险）。
    WiFi.setSleepMode(WIFI_MODEM_SLEEP);
    ESP8266BASE_LOG_I_P("WiFi", "sleep_policy=modem_sleep_min level=min_dtim_wake");
#endif
    ESP8266BASE_LOG_I_P("WiFi", "wifi_retry_policy connect_timeout=%lus sta_settle=%ums stuck_disconnected=%lus fast_retry=%lus fast_count=%u slow_retry=%lus radio_reset_failures=%u radio_settle=%ums",
                      (unsigned long)(ESP8266BASE_WIFI_CONNECT_TIMEOUT / 1000UL),
                      (unsigned)ESP8266BASE_WIFI_STA_SETTLE_MS,
                      (unsigned long)(ESP8266BASE_WIFI_STUCK_DISCONNECTED_MS / 1000UL),
                      (unsigned long)(ESP8266BASE_WIFI_RETRY_FAST / 1000UL),
                      (unsigned)ESP8266BASE_WIFI_RETRY_FAST_COUNT,
                      (unsigned long)(ESP8266BASE_WIFI_RETRY_SLOW / 1000UL),
                      (unsigned)ESP8266BASE_WIFI_RADIO_RESET_FAILURE_COUNT,
                      (unsigned)ESP8266BASE_WIFI_RADIO_RESET_SETTLE_MS);

    // 读取凭证并缓存，后续重连直接使用缓存，避免重复读 Flash
#if ESP8266BASE_USE_WIFI_CONFIG
    Esp8266BaseConfig::getStr(ESP8266BASE_CFG_KEY_WIFI_SSID, _staSSID, sizeof(_staSSID), "");
#endif

    if (strlen(_staSSID) > 0) {
#if ESP8266BASE_USE_WIFI_CONFIG
        Esp8266BaseConfig::getStr(ESP8266BASE_CFG_KEY_WIFI_PASS, _staPass, sizeof(_staPass), "");
#endif
        ESP8266BASE_LOG_I_P("WiFi", "loaded_saved_wifi_credentials ssid=%s password=[redacted] password_length=%u",
                          _staSSID, (unsigned)strlen(_staPass));
        _startSTA(_staSSID, _staPass);
    } else {
        // 无凭证，直接进入 AP 配网
        ESP8266BASE_LOG_I_P("WiFi", "no_saved_wifi_credentials starting_config_ap ssid=%s", _apSSID);
        _startAP();
    }

    return true;
}

// ----------------------------------------------------------------------------
// handle — 状态机推进（非阻塞）
// ----------------------------------------------------------------------------
void Esp8266BaseWiFi::handle() {
    switch (_state) {

        case Esp8266BaseWiFiState::CONNECTING: {
            uint32_t now = millis();

            if (_connectStart == 0) {
                if (_isDue(now, _retryAt)) {
                    _startSTA(_staSSID, _staPass);
                }
                break;
            }

            uint8_t status = (uint8_t)WiFi.status();
            if (status == WL_CONNECTED) {
                _handleConnected();
                break;
            }

            if (ESP8266BASE_WIFI_STUCK_DISCONNECTED_MS > 0 &&
                status == WL_DISCONNECTED &&
                now - _connectStart >= ESP8266BASE_WIFI_STUCK_DISCONNECTED_MS &&
                ESP8266BASE_WIFI_STUCK_DISCONNECTED_MS < ESP8266BASE_WIFI_CONNECT_TIMEOUT) {
                if (_stuckRestarted) {
                    ESP8266BASE_LOG_W_P("WiFi",
                                      "station_connect_stuck_retrying ssid=%s status=%s status_code=%u elapsed=%lums restart_count=1 rssi=%d",
                                      _staSSID,
                                      _statusName(status),
                                      (unsigned)status,
                                      (unsigned long)(now - _connectStart),
                                      (int)WiFi.RSSI());
                    WiFi.disconnect(false, false);
                    _scheduleRetry();
                    break;
                }
                ESP8266BASE_LOG_W_P("WiFi",
                                  "station_connect_stuck_restarting ssid=%s status=%s status_code=%u elapsed=%lums restart_count=1 rssi=%d",
                                  _staSSID,
                                  _statusName(status),
                                  (unsigned)status,
                                  (unsigned long)(now - _connectStart),
                                  (int)WiFi.RSSI());
                WiFi.disconnect(false, false);
                _startSTA(_staSSID, _staPass);
                _stuckRestarted = true;
                break;
            }

            if (now - _connectStart >= ESP8266BASE_WIFI_CONNECT_TIMEOUT) {
                ESP8266BASE_LOG_W_P("WiFi",
                                  "station_connect_timeout ssid=%s status=%s status_code=%u elapsed=%lums rssi=%d",
                                  _staSSID,
                                  _statusName(status),
                                  (unsigned)status,
                                  (unsigned long)(now - _connectStart),
                                  (int)WiFi.RSSI());
                WiFi.disconnect(false, false);
                _scheduleRetry();
            }
            break;
        }

        case Esp8266BaseWiFiState::CONNECTED: {
            uint8_t status = (uint8_t)WiFi.status();
            if (status != WL_CONNECTED) {
#if ESP8266BASE_USE_JOURNAL
                Esp8266BaseJournal::record(JNL_WIFI_LOST, static_cast<uint8_t>(status), 0, 0, 0);
#endif
                ESP8266BASE_LOG_W_P("WiFi",
                                  "station_connection_lost status=%s status_code=%u last_ip=%s rssi=%d reconnecting_with_saved_credentials",
                                  _statusName(status), (unsigned)status, _ip, (int)WiFi.RSSI());
                _ip[0]      = '\0';
                _retryCount   = 0;
                _stuckRestarted = false;
                _state        = Esp8266BaseWiFiState::CONNECTING;
                _connectStart = millis();
                _retryAt      = millis();   // 立即开始尝试
                _startSTA(_staSSID, _staPass);
            }
            break;
        }

        case Esp8266BaseWiFiState::AP_CONFIG: {
            break;
        }

        case Esp8266BaseWiFiState::IDLE:
        default:
            break;
    }
}

// ----------------------------------------------------------------------------
// connect — 保存新凭证并立即重连
// ----------------------------------------------------------------------------
bool Esp8266BaseWiFi::connect(const char* ssid, const char* pass) {
    size_t ssidLen = ssid ? strlen(ssid) : 0;
    if (ssidLen == 0) {
        ESP8266BASE_LOG_W_P("WiFi", "connect_rejected reason=empty_ssid");
        return false;
    }
    if (ssidLen > 32) {
        ESP8266BASE_LOG_W_P("WiFi", "connect_rejected reason=ssid_too_long length=%u max=32",
                          (unsigned)ssidLen);
        return false;
    }

    const char* safePass = pass ? pass : "";
    size_t passLen = strlen(safePass);
    if (passLen > 63) {
        ESP8266BASE_LOG_W_P("WiFi", "connect_rejected reason=password_too_long length=%u max=63",
                          (unsigned)passLen);
        return false;
    }

#if ESP8266BASE_USE_WIFI_CONFIG
    bool ssidSaved = Esp8266BaseConfig::setStr(ESP8266BASE_CFG_KEY_WIFI_SSID, ssid);
    bool passSaved = Esp8266BaseConfig::setStr(ESP8266BASE_CFG_KEY_WIFI_PASS, safePass);
#else
    bool ssidSaved = true;
    bool passSaved = true;
#endif
    ESP8266BASE_LOG_I_P("WiFi", "saving_wifi_credentials ssid=%s password=[redacted] password_length=%u ssid_saved=%s password_saved=%s",
                      ssid, (unsigned)passLen,
                      ssidSaved ? "yes" : "no", passSaved ? "yes" : "no");
    if (!ssidSaved || !passSaved) {
        ESP8266BASE_LOG_E_P("WiFi", "connect_rejected reason=failed_to_save_credentials");
        return false;
    }

    // 更新内存缓存，后续重连无需再读 Flash
    strncpy(_staSSID, ssid, sizeof(_staSSID) - 1);
    _staSSID[sizeof(_staSSID) - 1] = '\0';
    strncpy(_staPass, safePass, sizeof(_staPass) - 1);
    _staPass[sizeof(_staPass) - 1] = '\0';

    // 若当前在 AP 模式，先关闭 AP
    if (_state == Esp8266BaseWiFiState::AP_CONFIG) {
        WiFi.softAPdisconnect(true);
        delay(100);
    }

    _retryCount = 0;
    _failuresSinceRadioReset = 0;
    _startSTA(_staSSID, _staPass);
    return true;
}

// ----------------------------------------------------------------------------
// clearCredentials
// ----------------------------------------------------------------------------
bool Esp8266BaseWiFi::clearCredentials() {
#if ESP8266BASE_USE_WIFI_CONFIG
    Esp8266BaseConfig::setStr(ESP8266BASE_CFG_KEY_WIFI_SSID, "");
    Esp8266BaseConfig::setStr(ESP8266BASE_CFG_KEY_WIFI_PASS, "");
#endif
    _staSSID[0] = '\0';
    _staPass[0] = '\0';
    ESP8266BASE_LOG_I_P("WiFi", "saved_wifi_credentials_cleared");
    return true;
}

// ----------------------------------------------------------------------------
// 查询接口
// ----------------------------------------------------------------------------
bool Esp8266BaseWiFi::isConnected() {
    return (_state == Esp8266BaseWiFiState::CONNECTED)
           && (WiFi.status() == WL_CONNECTED);
}

const char* Esp8266BaseWiFi::ip() {
    return _ip;
}

const char* Esp8266BaseWiFi::ssid() {
    return _staSSID;
}

int Esp8266BaseWiFi::rssi() {
    return isConnected() ? (int)WiFi.RSSI() : 0;
}

void Esp8266BaseWiFi::macAddressTo(char* out, size_t len) {
    if (!out || len == 0) return;
    uint8_t mac[6];
    WiFi.macAddress(mac);
    snprintf(out, len, "%02X:%02X:%02X:%02X:%02X:%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
}

void Esp8266BaseWiFi::macAddressHex(char* out, size_t len) {
    if (!out || len == 0) return;
    uint8_t mac[6];
    WiFi.macAddress(mac);
    snprintf(out, len, "%02x%02x%02x%02x%02x%02x",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
}

Esp8266BaseWiFiState Esp8266BaseWiFi::state() {
    return _state;
}

uint16_t Esp8266BaseWiFi::attemptCount() {
    return _attemptCount;
}

uint8_t Esp8266BaseWiFi::radioResetCount() {
    return _radioResetCount;
}

bool Esp8266BaseWiFi::recoverStation() {
    if (_staSSID[0] == '\0' || _state == Esp8266BaseWiFiState::AP_CONFIG) return false;
    _ip[0] = '\0';
    ESP8266BASE_LOG_W_P("WiFi", "station_recovery_requested source=upper_transport action=radio_reset");
    _resetRadioAndStartSTA();
    return true;
}

const char* Esp8266BaseWiFi::apSSID() {
    return _apSSID;
}

// ----------------------------------------------------------------------------
// 内部辅助
// ----------------------------------------------------------------------------
void Esp8266BaseWiFi::_startSTA(const char* ssid, const char* pass, bool keepAP) {
    if (keepAP) {
        WiFi.mode(WIFI_AP_STA);
        WiFi.disconnect(false, false);
    } else {
        WiFi.mode(WIFI_STA);
        WiFi.disconnect(false, false);
    }
    delay(ESP8266BASE_WIFI_STA_SETTLE_MS);
    _beginSTA(ssid, pass, keepAP);
}

void Esp8266BaseWiFi::_beginSTA(const char* ssid, const char* pass, bool keepAP) {
    WiFi.begin(ssid, (pass && strlen(pass) > 0) ? pass : nullptr);
    if (_attemptCount < 0xFFFFU) {
        _attemptCount++;
    }
    if (!keepAP) {
        _state = Esp8266BaseWiFiState::CONNECTING;
    }
    _connectStart = millis();
    _retryAt      = millis();   // 立即开始计时
    _stuckRestarted = false;
    uint8_t status = (uint8_t)WiFi.status();
    ESP8266BASE_LOG_I_P("WiFi", "station_connecting ssid=%s password=[redacted] password_length=%u keep_config_ap=%s status=%s status_code=%u",
                      ssid, (unsigned)(pass ? strlen(pass) : 0),
                      keepAP ? "yes" : "no", _statusName(status), (unsigned)status);
}

void Esp8266BaseWiFi::_resetRadioAndStartSTA() {
    const uint8_t status = (uint8_t)WiFi.status();
    ESP8266BASE_LOG_W_P("WiFi",
                      "station_radio_reset_begin failures=%u total_attempts=%u status=%s status_code=%u",
                      (unsigned)_failuresSinceRadioReset,
                      (unsigned)_attemptCount,
                      _statusName(status),
                      (unsigned)status);

    // 普通 disconnect + begin 仍可能保留 ESP8266 SDK 的卡滞 station 状态。
    // 只重置无线子系统，不重启 MCU、不触碰 Config，也不切换到配置 AP。
    WiFi.disconnect(false, false);
    const bool offOk = WiFi.mode(WIFI_OFF);
    delay(ESP8266BASE_WIFI_RADIO_RESET_SETTLE_MS);
    const bool staOk = WiFi.mode(WIFI_STA);
    delay(ESP8266BASE_WIFI_STA_SETTLE_MS);

    if (_radioResetCount < 0xFFU) {
        _radioResetCount++;
    }
    _failuresSinceRadioReset = 0;
#if ESP8266BASE_USE_JOURNAL
    Esp8266BaseJournal::record(JNL_RADIO_RESET, 0, static_cast<int16_t>(_radioResetCount), 0, 0);
#endif
    ESP8266BASE_LOG_W_P("WiFi",
                      "station_radio_reset_complete reset_count=%u off=%s sta=%s action=reconnect",
                      (unsigned)_radioResetCount,
                      offOk ? "ok" : "failed",
                      staOk ? "ok" : "failed");
    _beginSTA(_staSSID, _staPass, false);
}

void Esp8266BaseWiFi::_startAP() {
    // Clean state before switching to AP
    WiFi.disconnect(true);
    delay(100);
    WiFi.mode(WIFI_AP);
    delay(100);

    // Force channel 6 to ensure macOS/iOS can see the AP
    int channel = 6;
    bool hidden = false;

    WiFi.softAP(_apSSID, nullptr, channel, hidden);
    _state = Esp8266BaseWiFiState::AP_CONFIG;
    char apIp[16];
    _formatIP(WiFi.softAPIP(), apIp, sizeof(apIp));
    ESP8266BASE_LOG_I_P("WiFi", "config_ap_started ssid=%s ip=%s channel=%d",
                      _apSSID, apIp, channel);
}

void Esp8266BaseWiFi::_handleConnected() {
    _updateIP();
    _state         = Esp8266BaseWiFiState::CONNECTED;
#if ESP8266BASE_USE_JOURNAL
    Esp8266BaseJournal::record(JNL_WIFI_UP, 0, static_cast<int16_t>(WiFi.RSSI()), 0, 0);
#endif
    _retryCount    = 0;
    _stuckRestarted = false;
    _failuresSinceRadioReset = 0;
    char gateway[16];
    char dns[16];
    _formatIP(WiFi.gatewayIP(), gateway, sizeof(gateway));
    _formatIP(WiFi.dnsIP(), dns, sizeof(dns));
    ESP8266BASE_LOG_I_P("WiFi", "station_connected ip=%s gateway=%s dns=%s rssi=%d",
                      _ip, gateway, dns, (int)WiFi.RSSI());
}

void Esp8266BaseWiFi::_scheduleRetry() {
    if (_retryCount < 0xFF) {
        _retryCount++;
    }
    if (_failuresSinceRadioReset < 0xFFU) {
        _failuresSinceRadioReset++;
    }
    if (ESP8266BASE_WIFI_RADIO_RESET_FAILURE_COUNT > 0 &&
        _failuresSinceRadioReset >= ESP8266BASE_WIFI_RADIO_RESET_FAILURE_COUNT) {
        _resetRadioAndStartSTA();
        return;
    }
    uint32_t interval = (_retryCount <= ESP8266BASE_WIFI_RETRY_FAST_COUNT)
        ? ESP8266BASE_WIFI_RETRY_FAST
        : ESP8266BASE_WIFI_RETRY_SLOW;
    uint8_t status = (uint8_t)WiFi.status();
    ESP8266BASE_LOG_W_P("WiFi", "station_reconnect_scheduled attempt=%d retry_in=%lus mode=%s status=%s status_code=%u rssi=%d",
                      (int)_retryCount, (unsigned long)(interval / 1000),
                      (_retryCount <= ESP8266BASE_WIFI_RETRY_FAST_COUNT) ? "fast" : "slow",
                      _statusName(status), (unsigned)status, (int)WiFi.RSSI());
    _connectStart = 0;
    _retryAt      = millis() + interval;
    _stuckRestarted = false;
}

bool Esp8266BaseWiFi::_isDue(uint32_t now, uint32_t due) {
    return static_cast<int32_t>(now - due) >= 0;
}

void Esp8266BaseWiFi::_updateIP() {
    IPAddress addr = WiFi.localIP();
    snprintf(_ip, sizeof(_ip), "%d.%d.%d.%d",
             addr[0], addr[1], addr[2], addr[3]);
}

const char* Esp8266BaseWiFi::_statusName(uint8_t status) {
    switch (status) {
        case WL_IDLE_STATUS:     return "WL_IDLE_STATUS";
        case WL_NO_SSID_AVAIL:   return "WL_NO_SSID_AVAIL";
        case WL_SCAN_COMPLETED:  return "WL_SCAN_COMPLETED";
        case WL_CONNECTED:       return "WL_CONNECTED";
        case WL_CONNECT_FAILED:  return "WL_CONNECT_FAILED";
        case WL_CONNECTION_LOST: return "WL_CONNECTION_LOST";
        case WL_DISCONNECTED:    return "WL_DISCONNECTED";
        default:                 return "WL_UNKNOWN";
    }
}
